import styles from './About.module.scss'

import carparts from 'assets/about/carparts.jpg'
import lights from 'assets/about/lights.jpg'
import oil from 'assets/about/oil.jpg'

export const About = ({ aboutRef }) => {
	return (
		<div className={styles.about} ref={aboutRef}>
			<div className={styles.blockInfo}>
				<div className={styles.text}>
					<h1>Про нас</h1>
					<p>
						Наш магазин автозапчастин у Богородчанах – це місце, де ви знайдете
						все необхідне для ремонту та обслуговування вашого авто. Незважаючи
						на компактні розміри, ми пропонуємо широкий асортимент запчастин для
						різних марок і моделей, забезпечуючи якість та надійність кожної
						деталі.
						<br />
						<br />
						Ми працюємо на ринку вже багато років, завоювавши довіру сотень
						задоволених клієнтів. Репутація для нас – понад усе, тому ми завжди
						гарантуємо якісний сервіс, доступні ціни та професійну допомогу у
						виборі запчастин.
						<br />
						<br />
						Завітайте до нас – тут знайдеться все, що потрібно для вашого авто!
					</p>
				</div>
				<img src={carparts} alt='' />
			</div>

			<div className={`${styles.blockInfo} ${styles.center}`}>
				<img src={lights} alt='' />
				<div className={styles.text}>
					<h1>Чому варто вибирати запчастини у нас? </h1>
					<p>
						Ми прагнемо бути вашим надійним партнером у світі автозапчастин,
						пропонуючи тільки якісну продукцію, яка відповідає стандартам
						безпеки та довговічності. У нашому каталозі ви знайдете широкий
						вибір деталей для різних марок і моделей авто, що дозволяє швидко
						підібрати необхідну запчастину без зайвих зусиль.
						<br />
						<br />
						Ми співпрацюємо лише з перевіреними виробниками, тому кожен товар
						проходить контроль якості перед тим, як потрапити до вас. Наші ціни
						залишаються доступними завдяки прямим поставкам без посередників, що
						дозволяє нам пропонувати найкращі умови для наших клієнтів.
					</p>
				</div>
			</div>

			<div className={styles.blockInfo}>
				<div className={styles.text}>
					<h1>Як продовжити термін служби автозапчастин? Купуйте якісне!</h1>
					<p>
						Довговічність автозапчастин залежить не тільки від правильної
						експлуатації, а й від їхньої якості. У нашому магазині в
						Богородчанах ви знайдете лише перевірені деталі, які відповідають
						стандартам виробників. Ми допоможемо вам підібрати оптимальні
						запчастини для вашого авто, щоб уникнути частих замін та
						несподіваних поломок.
						<br />
						<br />
						Також важливо дотримуватись рекомендацій щодо встановлення та
						обслуговування. Наші фахівці завжди готові проконсультувати вас, щоб
						ваша покупка була максимально вигідною та довговічною. Обирайте
						якість – обирайте нас!
					</p>
				</div>
				<img src={oil} alt='' />
			</div>
		</div>
	)
}
